IXMATIX/IXMATIX-Board/samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

ixmatixrobotics_ixmatix.name=IXMATIX
ixmatixrobotics_ixmatix.vid.0=0x1209
ixmatixrobotics_ixmatix.pid.0=0x2407
ixmatixrobotics_ixmatix.vid.1=0x1209
ixmatixrobotics_ixmatix.pid.1=0x2407
ixmatixrobotics_ixmatix.upload.tool=bossac
ixmatixrobotics_ixmatix.upload.protocol=sam-ba
ixmatixrobotics_ixmatix.upload.maximum_size=253952
ixmatixrobotics_ixmatix.upload.offset=0x2000
ixmatixrobotics_ixmatix.upload.use_1200bps_touch=true
ixmatixrobotics_ixmatix.upload.wait_for_upload_port=true
ixmatixrobotics_ixmatix.upload.native_usb=true
ixmatixrobotics_ixmatix.build.mcu=cortex-m0plus
ixmatixrobotics_ixmatix.build.f_cpu=48000000L
ixmatixrobotics_ixmatix.build.usb_product="IXMATIX"
ixmatixrobotics_ixmatix.build.usb_manufacturer="IXMATIX Robotics"
ixmatixrobotics_ixmatix.build.board=ixmatix
ixmatixrobotics_ixmatix.build.core=arduino
ixmatixrobotics_ixmatix.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
ixmatixrobotics_ixmatix.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
ixmatixrobotics_ixmatix.build.openocdscript=openocd_scripts/SAMD21G18A.cfg
ixmatixrobotics_ixmatix.build.variant=ixmatix
ixmatixrobotics_ixmatix.build.variant_system_lib=
ixmatixrobotics_ixmatix.build.vid=0x1209
ixmatixrobotics_ixmatix.build.pid=0x2407
ixmatixrobotics_ixmatix.bootloader.tool=openocd
ixmatixrobotics_ixmatix.bootloader.file=ixmatix/bootloader-ixmatix.bin